# Advanced python pandas

## Merging Dataframes

### create Dataframe

In [25]:
import pandas as pd

df = pd.DataFrame(
    [
        {'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
        {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
        {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00},
    ],
    index = ['Store 1', 'Store 1', 'Store 2']
)

df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

### adding new field

In [26]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-May

In [27]:
df['Delivered'] = True
df

         Cost Item Purchased   Name        Date  Delivered
Store 1  22.5         Sponge  Chris  December 1       True
Store 1   2.5   Kitty Litter  Kevyn   January 1       True
Store 2   5.0          Spoon  Filip     mid-May       True

In [28]:
df['Feedback'] = ['Positiv', None, 'Negative']
df

         Cost Item Purchased   Name        Date  Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1       True   Positiv
Store 1   2.5   Kitty Litter  Kevyn   January 1       True      None
Store 2   5.0          Spoon  Filip     mid-May       True  Negative

In [29]:
df = df.reset_index()

### update field

In [31]:
df['Date'] = pd.Series({0:'December 1', 2:'mid-May'})
df

     index  Cost Item Purchased   Name        Date  Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December 1       True   Positiv
1  Store 1   2.5   Kitty Litter  Kevyn         NaN       True      None
2  Store 2   5.0          Spoon  Filip     mid-May       True  Negative

### join datafrate together

In [34]:
staff_df = pd.DataFrame(
    [
        {'Name': 'Kelly', 'Role': 'Director of HR'},
        {'Name': 'Sally', 'Role': 'Course liaison'},
        {'Name': 'James', 'Role': 'Grader'},
    ]
)
staff_df = staff_df.set_index('Name')
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liaison
James          Grader

In [35]:
student_df = pd.DataFrame(
    [
        {'Name': 'James', 'School': 'Business'},
        {'Name': 'Mike', 'School': 'Law'},
        {'Name': 'Sally', 'School': 'Engineering'},
    ]
)
student_df = student_df.set_index('Name')
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [36]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liaison  Engineering

In [37]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liaison  Engineering
James          Grader     Business

In [38]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liaison  Engineering
James          Grader     Business

In [39]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liaison  Engineering

In [41]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

   index_x   Name            Role  index_y       School
0        0  Kelly  Director of HR      NaN          NaN
1        1  Sally  Course liaison      2.0  Engineering
2        2  James          Grader      0.0     Business

In [43]:
staff_df = pd.DataFrame(
    [
        {'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
        {'Name': 'Sally', 'Role': 'Course liaison', 'Location': 'Washington Avenue'},
        {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'},
    ]
)
student_df = pd.DataFrame(
    [
        {'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
        {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
        {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'},
    ]
)

pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liaison   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [44]:
staff_df = pd.DataFrame(
    [
        {'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR', 'Location': 'State Street'},
        {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liaison', 'Location': 'Washington Avenue'},
        {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader', 'Location': 'Washington Avenue'},
    ]
)
student_df = pd.DataFrame(
    [
        {'First Name': 'James', 'Last Name': 'Wilde', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
        {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law', 'Location': 'Fraternity House #22'},
        {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering', 'Location': '512 Wilson Crescent'},
    ]
)

pd.merge(staff_df, student_df, how='inner', left_on=['First Name', 'Last Name'], right_on=['First Name', 'Last Name'])

,First Name,Last Name,Location_x,Role,Location_y,School
0,Sally,Brooks,Washington Avenue,Course liaison,512 Wilson Crescent,Engineering
1,James,Wilde,Washington Avenue,Grader,1024 Billiard Avenue,Business